app/controllers/autocomplete_controller.rb

SELECT CONCAT("`",TABLE_NAME,"`",".","`",COLUMN_NAME,"`") name, 3 `weight` FROM `COLUMNS` WHERE (`COLUMNS`.`TABLE_SCHEMA` = 'fsdfsdf')
SELECT concat("`",TABLE_NAME,"`") name, 4 weight FROM `TABLES` WHERE (`TABLES`.`TABLE_SCHEMA` = 'fsdfsdf')
---
    def full_structure
        @db_name = request[:database_name]
        @result[:rows] = Column.where(TABLE_SCHEMA: @db_name).
                         select('CONCAT("`",TABLE_NAME,"`",".","`",COLUMN_NAME,"`") name, 3 `weight`')

        @result[:rows] += Table.select('concat("`",TABLE_NAME,"`") name, 4 weight').where(TABLE_SCHEMA: @db_name)