app/controllers/database_controller.rb

SELECT table_schema, round(sum(data_length+index_length)/1024/1024, 2) mb_size FROM `TABLES` GROUP BY table_schema
---
    def index
        self.change_schema_to 'information_schema'
        # if databaseName is specified find info about it
        # else for all
        @result[:single_request] = !request[:database_name].nil?
        query = @result[:single_request] ? Schemata.where(SCHEMA_NAME: request[:database_name]) : Schemata
        #join to triggers routines
        @database_list = query.routines.tables.triggers #get all triggers, routines, tables
        .select('SCHEMATA.SCHEMA_NAME database_name, TABLES.TABLE_NAME table_name, TABLES.ENGINE table_engine,
                 ROUTINES.ROUTINE_NAME routine_name, ROUTINES.ROUTINE_TYPE routine_type, TRIGGERS.EVENT_MANIPULATION event_type, TRIGGERS.ACTION_TIMING action_timing,
                 TRIGGERS.TRIGGER_NAME trigger_name, TABLES.TABLE_TYPE table_type').
            order('database_name', 'table_name')