app/controllers/function_controller.rb

  def structure
    change_schema_to 'information_schema'
    @result = {success: true, desc: []}
    @database_name = request[:database_name]
    @function_name = request[:name]

    desc = Routine.where(ROUTINE_NAME: @function_name, ROUTINE_TYPE: 'FUNCTION', ROUTINE_SCHEMA: @database_name).first.attributes
---
SELECT `ROUTINES`.* FROM `ROUTINES` WHERE (`ROUTINES`.`ROUTINE_NAME` = 'fdfs') AND (`ROUTINES`.`ROUTINE_TYPE` = 'FUNCTION') AND (`ROUTINES`.`ROUTINE_SCHEMA` = 'stunnCash') LIMIT 1