app/controllers/procedure_controller.rb

  def structure
    change_schema_to 'information_schema'
    @result = {success: true, desc: []}
    @database_name = request[:database_name]
    @procedure_name = request[:name]

    desc = Routine.where(ROUTINE_NAME: @procedure_name, ROUTINE_TYPE: 'PROCEDURE', ROUTINE_SCHEMA: @database_name).first.attributes
---
SELECT `ROUTINES`.* FROM `ROUTINES` WHERE (`ROUTINES`.`ROUTINE_NAME` = 'UpdateTransactionsStatuses') AND (`ROUTINES`.`ROUTINE_TYPE` = 'PROCEDURE') AND (`ROUTINES`.`ROUTINE_SCHEMA` = 'stunnCash') LIMIT 1