app/controllers/table_controller.rb

    def index
        self.change_schema_to 'information_schema';
        @database_name = request[:database_name]
        #this hash will be returned to client
        @result = {
            success: true,
            rows:    [{
                tables: Table.where(TABLE_SCHEMA: @database_name,TABLE_TYPE: 'BASE TABLE').
                        select(%[TABLE_NAME table_name,ENGINE engine]).
                        inject([]) {|a,item| a.push [item[:table_name],item[:engine]]}
            }]
---
SELECT TABLE_NAME table_name,ENGINE engine FROM `TABLES` WHERE (`TABLES`.`TABLE_SCHEMA` = 'cash') AND (`TABLES`.`TABLE_TYPE` = 'BASE TABLE')

    def structure
        self.change_schema_to 'information_schema';
        @database_name, @table_name = request[:database_name], request[:name]
        @result = Hash.new success: true
        @result[:columns] = Column.where TABLE_SCHEMA: @database_name, TABLE_NAME: @table_name
        structure = Table.where(TABLE_SCHEMA: @database_name, TABLE_NAME: @table_name).first.attributes
---
SELECT `COLUMNS`.* FROM `COLUMNS` WHERE (`COLUMNS`.`TABLE_SCHEMA` = 's36') AND (`COLUMNS`.`TABLE_NAME` = 'Plan')
SELECT `TABLES`.* FROM `TABLES` WHERE (`TABLES`.`TABLE_SCHEMA` = 's36') AND (`TABLES`.`TABLE_NAME` = 'Plan') LIMIT 1