app/controllers/trigger_controller.rb

    def content
        @database_name, @trigger_name = request[:database_name], request[:trigger_name]
        trigger = Trigger.where(TRIGGER_NAME: @trigger_name, TRIGGER_SCHEMA: @database_name).first.attributes
---
SELECT `TRIGGERS`.* FROM `TRIGGERS` WHERE (`TRIGGERS`.`TRIGGER_NAME` = 'currentdate') AND (`TRIGGERS`.`TRIGGER_SCHEMA` = 'stunnCash') LIMIT 1

    def structure
        @result = {success: true, desc: []}
        @database_name = request['database_name']
        @trigger_name = request['name']

        desc = Trigger.where(TRIGGER_NAME: @trigger_name, TRIGGER_SCHEMA: @database_name).first.attributes
---
SELECT `TRIGGERS`.* FROM `TRIGGERS` WHERE (`TRIGGERS`.`TRIGGER_NAME` = 'currentdate') AND (`TRIGGERS`.`TRIGGER_SCHEMA` = 'stunnCash') LIMIT 1